/**************************************************
* 정렬 - ORDER BY
* SELECT 열명 FROM 테이블명 WHERE 조건식 ORDER BY 열명
**************************************************/

/**************************************************
* ORDER BY로 검색 결과 정렬하기
* 검색 조건이 있을때
* SELECT 열명 FROM 테이블명 WHERE 조건식 ORDER BY 열명
* 검색 조건이 없을때
* SELECT 열명 FROM 테이블명 ORDER BY 열명
**************************************************/
/**************************************************
* age 열로 정렬하기
**************************************************/
SELECT * FROM sample31 ORDER BY age;